13/data/attachments/e12b84cb2b83f949.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e68121d1-a160-4b43-b0de-9e07121b941b</nif:username>
            <nif:friendToBeAdded>Linda_shake_Friend_81360_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>